import React, { Component } from "react";
import { isAuthenticated, signout } from "../../auth";
import { create } from "./apiStudent";
import { Redirect, Link } from "react-router-dom";
import { Navbar, Nav, NavDropdown, Dropdown, DropdownButton} from 'react-bootstrap';

class Bully extends Component {
    constructor() {
        super();
        this.state = {
            parent: "",
            student: "",
            birthday: "",
            contact: "",
            error: "",
            user: {},
            fileSize: 0,
            loading: false,
            redirectToProfile: false,
            spanishPage: false,
            englishPage: false,
            khmerPage: false
        };
    }

    renderUser = () => {
        this.setState({user: isAuthenticated().user })
    }

    componentDidMount() {
        this.renderUser()
    }

    componentWillReceiveProps() {
        this.renderUser()
    }

    translateSpanish = () => {
        this.setState({spanishPage: true, englishPage: false, khmerPage: false})
    }

    translateEnglish = () => {
        this.setState({englishPage: true, spanishPage: false, khmerPage: false})
    }

    translateKhmer = () => {
        this.setState({khmerPage: true, spanishPage: false, englishPage: false,})
    }

    renderTopHeader = () => {
        return (
            <div style={{border: 'solid black 2px', width: '100%'}}>
                <Navbar id='topHeader' collapseOnSelect expand="lg" variant="dark" >
                <Navbar.Toggle aria-controls="responsive-navbar-nav" />
                <Navbar.Collapse id="responsive-navbar-nav">
                    <Nav className="mr-auto " >
                    <DropdownButton id="dropdown-basic-button" title="translator"  >
                                <Dropdown.Item ><a onClick={this.translateSpanish}>Spanish</a>
                                </Dropdown.Item>
                                <Dropdown.Item ><a onClick={this.translateKhmer}>Cambodian</a>
                                </Dropdown.Item>
                                <Dropdown.Item><a>Hmong</a></Dropdown.Item>

                                <Dropdown.Item><a onClick={this.translateEnglish}>English</a></Dropdown.Item>

                                <Dropdown.Item><a>Portuguese</a></Dropdown.Item>
                            
                    </DropdownButton>
                        
                        {
                            !this.state.user && (
                               <nav className='row'>
                                <Nav.Link >
                                    <Link className='ml-3' to='/khmer/signin' style={{color: 'white'}}>
                                    ចុះឈ្មោះ
                                    </Link>
                                </Nav.Link>
                                <Nav.Link>
                                    <Link style={{color: 'white'}} to='/khmer/signup' >
                                    ចុះឈ្មោះ
                                    </Link>
                                </Nav.Link>
                               </nav>
                            )
                        }
                        
                        {
                            this.state.user && (
                                <Nav.Link>
                                    <a style={{color: 'white'}}  onClick={() => signout(() => {
                                        this.props.history.push('/khmer')
                                    })}>
                                        ផ្តាច់
                                    </a>
                                </Nav.Link>
                            )
                        }

                        {
                            isAuthenticated() && isAuthenticated().user.role === 'admin' && (
                                <Nav.Link>
                                    <Link style={{color: 'white', marginLeft: '1070px'}} to='/khmer/application' >
                                        ពាក្យសុំ
                                    </Link>
                                </Nav.Link>
                            )
                        }

                        
                      
                    </Nav>
                </Navbar.Collapse>
            </Navbar>
            </div>
        )
    }


    renderMenu = () => {
        return (
            <div>
                 <Navbar id='menu' collapseOnSelect expand="lg" variant="dark"  >
                <Navbar.Toggle aria-controls="responsive-navbar-nav" />
                <Navbar.Collapse id="responsive-navbar-nav">
                    
                    <Nav className="mr-auto " className="col d-flex justify-content-around align-items-baseline">
                         <div id='link'>                        
                            <Nav.Link ><Link style={{color: 'white'}} to='/khmer'>ផ្ទះ</Link></Nav.Link>
                        </div>

                        <div id='link'>                        
                            <Nav.Link><Link style={{color: 'white'}} to='/khmer/about'>អំពី​ពួក​យើង</Link></Nav.Link>
                        </div>

                       <div id='link'>                
                           <Nav.Link ><Link style={{color: 'white'}} to='/khmer/faculty'>មហាវិទ្យាល័យ</Link></Nav.Link>
                        </div>
                        <Nav.Link ><Link style={{color: 'white'}} to='/khmer/student'>និស្សិត</Link></Nav.Link>
                        
                        
                        <div id='link'>                        
                            <Nav.Link ><Link style={{color: 'white'}} to='/khmer/admission'>ការចូលរៀន</Link></Nav.Link>
                        </div>

                        <div id='link'>                        
                            <Nav.Link><Link style={{color: 'white'}} to='/khmer/schoolBoardMeeting'>ក្រុមប្រឹក្សាភិបាលសាលា</Link></Nav.Link>
                        </div>

                        <div id='link'>                        
                            <Nav.Link ><Link style={{color: 'white'}} to='/khmer/partners'>ដៃគូរបស់យើង</Link></Nav.Link>
                        </div>

                        <div id='link'>                        
                            <Nav.Link ><Link style={{color: 'white'}} to='/khmer/images'>វិចិត្រសាល</Link></Nav.Link>
                        </div>

                        <div id='link'>                        
                            <Nav.Link ><Link style={{color: 'white'}} to='/khmerevents'>ព្រឹត្តិការណ៍ជិតមកដល់</Link></Nav.Link>
                        </div>
                    
                    </Nav>
                </Navbar.Collapse>
            </Navbar>
            </div>
        )
    }
    
    render() {
        const {spanishPage, englishPage, khmerPage } = this.state;

        if(spanishPage) {
            return <Redirect to={`/spanish/student`} />
         } else if (englishPage) {
             return <Redirect to={'/student'} />
         } else if (khmerPage) {
            return <Redirect to={'/khmer/student'} />
        }

        return (
            <div>
                {this.renderTopHeader()}
                <div className="text-center">
                        <img 
                            style={{height: '150px', width: '600px', backgroundColor: 'blue'}}
                            src={require("../../images/logo.png")}
                        />
                    </div>
                {this.renderMenu()}
                <div className='container mt-4' >
                    <h3>ប៉ូលីសនិងការធ្វើបាបនិងការធ្វើបាបដោយប៉ូលីស</h3>
                    <div>
                    <p>
                        គោលការណ៍ណែនាំ៖ ក្រុមប្រឹក្សាភិបាលសាលាប្រូដជឿថាការការពារការសម្លុតនិង / ឬ
                        ការសម្លុតគឺមានសារៈសំខាន់ក្នុងការបង្កើតនិងថែរក្សាបរិយាកាសនិងវប្បធម៌សាលារៀនប្រកបដោយសុវត្ថិភាពនិងវិជ្ជមានដែលគាំទ្រដល់សមិទ្ធិផលសិក្សាបង្កើនការចូលរួមសាលាគោរពសិទ្ធិរបស់ប្រជាជននិងក្រុមទាំងអស់និងកសាងសហគមន៍ដោយគោលបំណង។
                        </p>

                        <p>
                        គោលបំណង៖ ដើម្បីការពារសិទ្ធិរបស់ប្រជាជនទាំងអស់ក្នុងការចូលរួមបង្រៀននិងរៀន
                        ការសម្លុតនិង / ឬការយាយីពីសំណាក់សិស្សលោកគ្រូអ្នកគ្រូបុគ្គលិកបុគ្គលិកមាតាបិតាឬដៃគូសហគមន៍ដែលចូលរួមក្នុងសកម្មភាពសាលារៀនណាមួយដែលមានការអនុញ្ញាត (ដូចមានចែងក្នុងក។ ស។ ជ។ ខាងក្រោម) ត្រូវបានហាមឃាត់។
                        ដើម្បីកំណត់ឱ្យបានច្បាស់លាស់នូវអ្វីដែលបង្កើតជាការសម្លុតនិង / ឬសកម្មភាពយាយីដើម្បីបង្ហាញពីសារៈសំខាន់នៃការឆ្លើយតបចំពោះការសម្លុតនិង / ឬអាកប្បកិរិយាយាយីនិងដើម្បីបញ្ជាក់ពីវិសាលភាពដែលអគ្គនាយកនៃនាយកដ្ឋានផ្តល់សេវាសាធារណៈសាធារណៈ (PPSD) ត្រូវអនុវត្តវិធានការណ៍នានា។ វិន័យ សកម្មភាពដូចដែលបានបញ្ជាក់នៅក្នុងគោលនយោបាយក្រុមប្រឹក្សាភិបាលសាលាផ្តល់សេវាដូចខាងក្រោមនិងនីតិវិធីសាលាស្រុក៖ សិទ្ធិនិងការទទួលខុសត្រូវរបស់សិស្សក្រមសីលធម៌វិន័យរបស់សិស្សនិងផែនការសុវត្ថិភាពរបស់សាលា។
                        </p>

                        <p>
                        និយមន័យៈការសម្លុតគំរាមកំហែងត្រូវបានកំណត់ថាជាការបំភិតបំភ័យការបំភិតបំភ័យឬការរំលោភបំពានដោយ
                        អ្នកផ្សេងទៀតនៅក្នុងសហគមន៍សាលារៀនដោយផ្អែកលើអំណាចរូបវន្តផ្លូវចិត្តឬសង្គមមិនស្មើគ្នាឬអំណាចដែលគេដឹង។ ការសម្លុតធ្វើបាបមិនរាប់បញ្ចូលធាតុផ្សំនៃភាពលំអៀង (ដូចដែលបានកំណត់ខាងក្រោមនៅក្នុងការរំខាន) ។ ការសម្លុតធ្វើបាបរួមមានការសម្លុតនិងសម្លុតតាមអ៊ីនធឺណិត (ដូចបានកំណត់ខាងក្រោម) ។
                        ការសម្លុតធ្វើបាបពាក់ព័ន្ធនឹងអាកប្បកិរិយាដែលអាចបង្កអន្តរាយដល់រាងកាយនិង / ឬផ្លូវចិត្តមិនត្រូវបានស្វាគមន៍មិនមានចេតនាមិនរឹបអូសនិងត្រូវបានធ្វើម្តងទៀត។ ការសម្លុតសម្លុតអាចជាពាក្យសំដីរាងកាយផ្ទាល់ (ទល់មុខគ្នា) ឬដោយប្រយោល (ឧទាហរណ៍តាមរយៈមនុស្សម្នាក់ទៀតជាលាយលក្ខណ៍អក្សរ។ ល។ ) ។
                        </p>


<p>
                        ការយាយីត្រូវបានគេកំណត់ថាជាឥរិយាបទរើសអើងដែលមិនចង់បានចេតនានិងគ្មានការទទួលខុសត្រូវចំពោះមនុស្សឬមនុស្សដែលជម្រុញដោយការរើសអើងផ្អែកលើលក្ខណៈមួយឬច្រើននៃលក្ខណៈពិតឬការយល់ឃើញខាងក្រោមនិង / ឬប្រភេទដែលត្រូវបានការពារស្របច្បាប់៖ ពូជសាសន៍ពណ៌សម្បុរសាសនា , ជនជាតិ / ដើមកំណើតធម្មជាតិ, ពិការភាព, ភេទ, ទំនោរផ្លូវភេទ, អត្តសញ្ញាណយេនឌ័រនិងអាយុ។ ការយាយីរួមមានការសម្លុតតាមអ៊ិនធឺរណែត (ដូចបានកំណត់ខាងក្រោម) ។
                        </p>

                        <p>
                        ការយាយីផ្លូវភេទត្រូវបានកំណត់ថាជាការយាយីផ្លូវភេទនៅក្នុងបរិយាកាសអរិភាពឬការយាយីផ្លូវភេទ Quid Pro Quo ។ ការយាយីផ្លូវភេទអាចកើតឡើងពីសិស្សម្នាក់ទៅសិស្សពីមនុស្សពេញវ័យទៅសិស្សពីសិស្សម្នាក់ទៅមនុស្សពេញវ័យពីមនុស្សពេញវ័យរហូតដល់មនុស្សពេញវ័យពីស្ត្រីម្នាក់ទៅស្ត្រីម្នាក់ពីស្ត្រីម្នាក់ទៅស្ត្រីម្នាក់និងពីបុរសម្នាក់ទៅបុរស។
                        ការយាយីផ្លូវភេទនៅក្នុងបរិយាកាសអរិភាពកើតឡើងនៅពេលដែលការជម្រុញផ្លូវភេទដែលមិនចង់បានការស្នើសុំការអនុគ្រោះខាងផ្លូវភេទឬការប្រព្រឹត្តផ្លូវភេទដោយពាក្យសំដីកាយវិការឬកាយសម្បទាផ្លូវភេទរបស់សិស្សដទៃទៀតនិយោជិកសាលាឬភាគីទីបីលើទ្រព្យសម្បត្តិសាលាឬ នៅក្នុងសកម្មភាពដែលទាក់ទងនឹងសាលារៀន។ គ្រប់គ្រាន់ល្មមរាលដាលឬខ្ជាប់ខ្ជួនក្នុងការជ្រៀតជ្រែកឬកំណត់សមត្ថភាពរបស់សិស្សក្នុងការចូលរួមឬទទួលបានអត្ថប្រយោជន៍ពីកម្មវិធីឬសកម្មភាពរបស់ PPSD ឬដើម្បីជ្រៀតជ្រែកឬកំណត់លើបុគ្គលឬបុគ្គល។
                        ការងារបង្កើតបរិយាកាសស្អប់ខ្ពើមបំភិតបំភ័យបំភិតបំភ័យឬវាយលុកបរិយាកាសអប់រំឬការងារ។ ជនរងគ្រោះក៏អាចជាមនុស្សម្នាក់ដែលរងផលប៉ះពាល់ដោយអាកប្បកិរិយាដែលសំដៅទៅមនុស្សម្នាក់ផ្សេងទៀត។
                        </p>

                        <p>
                        ការយាយីផ្លូវភេទ Quid Pro Quo កើតឡើងនៅពេលនិយោជិករបស់ PPSD ឬនិស្សិតឬលក្ខខណ្ឌជាក់លាក់ចូលរួមក្នុងកម្មវិធីអប់រំឬសកម្មភាពឬផ្អែកលើការសម្រេចចិត្តអប់រំស្តីពីការដាក់ស្នើរបស់សិស្សទៅនឹងការជម្រុញផ្លូវភេទការស្នើសុំការពេញចិត្តខាងផ្លូវភេទឬការប្រព្រឹត្តពាក្យសំដីផ្សេងទៀតឬ រូបវន្តបុគ្គលដែលមានលក្ខណៈផ្លូវភេទទោះបីជាសិស្សចុះចាញ់នឹងអាកប្បកិរិយាក៏ដោយ។ ការបៀតបៀនផ្លូវភេទមិនសមរម្យក៏កើតមានផងដែរនៅពេលដែលបុគ្គលិក PPSD ដាក់លក្ខខណ្ឌការងាររបស់ PPSD ដោយបញ្ជូនទៅភាពជឿនលឿនខាងផ្លូវភេទការស្នើសុំការអនុគ្រោះខាងផ្លូវភេទឬការនិយាយពាក្យសំដីឬកាយសម្បទាខាងផ្លូវភេទឬជាមូលដ្ឋានសម្រាប់ការសម្រេចចិត្តការងារ (រួមទាំង ក្នុងចំនោមអ្នកផ្សេងទៀត) ចំពោះការលើកកម្ពស់ការបន្ទាបបន្ថោកការផ្លាស់ប្តូរភារកិច្ចឬកាលវិភាគឬការពិនិត្យឡើងវិញនៃការអនុវត្ត) ។
                        ការយាយីផ្លូវភេទនៅក្នុងបរិយាកាសអរិភាពកើតឡើងនៅពេលដែលការជម្រុញផ្លូវភេទដែលមិនចង់បានការស្នើសុំការអនុគ្រោះខាងផ្លូវភេទឬការប្រព្រឹត្តផ្លូវភេទដោយពាក្យសំដីកាយវិការឬកាយសម្បទាផ្លូវភេទរបស់សិស្សដទៃទៀតនិយោជិកសាលាឬភាគីទីបីលើទ្រព្យសម្បត្តិសាលាឬ នៅក្នុងសកម្មភាពដែលទាក់ទងនឹងសាលារៀន។ គ្រប់គ្រាន់ល្មមរាលដាលឬខ្ជាប់ខ្ជួនក្នុងការជ្រៀតជ្រែកឬកំណត់សមត្ថភាពរបស់សិស្សក្នុងការចូលរួមឬទទួលបានអត្ថប្រយោជន៍ពីកម្មវិធីឬសកម្មភាពរបស់ PPSD ឬដើម្បីជ្រៀតជ្រែកឬកំណត់លើបុគ្គលឬបុគ្គល។
                        ការងារបង្កើតបរិយាកាសស្អប់ខ្ពើមបំភិតបំភ័យបំភិតបំភ័យឬវាយលុកបរិយាកាសអប់រំឬការងារ។ ជនរងគ្រោះក៏អាចជាមនុស្សម្នាក់ដែលរងផលប៉ះពាល់ដោយអាកប្បកិរិយាដែលសំដៅទៅមនុស្សម្នាក់ផ្សេងទៀត។
                        </p>
                       
<p>
                        ការវាយលុកតាមអ៊ិនធឺរណែតត្រូវបានកំណត់ថាជាការបំផ្លាញដោយចេតនានិងម្តងហើយម្តងទៀតក្នុងចំណោមការប្រើប្រាស់ផ្សេងទៀតដោយការប្រើប្រាស់កុំព្យួទ័រទូរស័ព្ទចល័តនិងឧបករណ៍អេឡិចត្រូនិចផ្សេងទៀត។ ខាងក្រោមនេះគឺជាឧទាហរណ៍នៃការសម្លុតតាមអ៊ិនធឺរណែតនៅពេលដែលពួកគេមានចេតនានិងនាំឱ្យមានគ្រោះថ្នាក់ដល់សង្គមនិង / ឬទុក្ខព្រួយ៖
                        •ផ្ញើសារតាមអ៊ិនធរណេតឬប្រើទូរស័ព្ទដៃឬឧបករណ៍ឬឧបករណ៍ផ្ទុកសម្រាប់សារ
                        ផ្ញើឬផ្សព្វផ្សាយអត្ថបទរូបភាពសម្លេងឬវីដេអូនៅលើអ៊ីនធឺណិតឬអ៊ិនធឺរណែតតាមរយៈទូរស័ព្ទដៃឬបណ្តាញអេឡិចត្រូនិច (sexting) រួមទាំងគេហទំព័របណ្តាញសង្គម។
                        •ផ្ញើរូបភាពគំរាមគំហែងបំភិតបំភ័យរូបភាពក្រាហ្វិចឬរូបភាពអាសអាភាសតាមអ៊ិនធរណេតឬប្រើទូរស័ព្ទដៃរឺបណ្តាញអេឡិចត្រូនិចរួមទាំងបណ្តាញសង្គម
                        </p>

                        <p>
    Cyberbullying ត្រូវបានកំណត់ថាជាការខូចខាតដោយចេតនាដែលបណ្តាលមកពីការប្រើប្រាស់កុំព្យូទ័រទូរស័ព្ទដៃនិងឧបករណ៍អេឡិចត្រូនិកផ្សេងៗទៀតដែលជម្រុញដោយការរើសអើងដោយផ្អែកលើលក្ខណៈមួយឬច្រើននៃលក្ខណៈពិតឬការយល់ឃើញខាងក្រោមនិង / ឬប្រភេទការពារដោយស្របច្បាប់។ ៖ ពូជសាសន៍ពណ៌សម្បុរសាសនាជនជាតិដើមភាគតិចពិការភាពភេទនិន្នាការភេទនិងអត្តសញ្ញាណយេនឌ័រ។ </p>
    <p>
    ការវាយឆ្មក់ត្រូវបានកំណត់ថាជាសកម្មភាពរំពឹងទុករបស់អ្នកណាម្នាក់ដែលចូលរួមជាមួយក្រុមដែលធ្វើឱ្យអាម៉ាស់មុខថោកទាបការរំលោភបំពានឬមានគ្រោះថ្នាក់ដល់ជីវិតដោយមិនគិតពីឆន្ទៈរបស់ប្រជាជនក្នុងការចូលរួម។

    </p>
    <p>
    ការសងសឹកត្រូវបានកំណត់ថាជាទម្រង់នៃការបំភិតបំភ័យការសងសឹកឬការយាយីដោយសមាជិកនៃសហគមន៍ PPSD ដែលបានដឹកនាំប្រឆាំងនឹងសមាជិកនៃសហគមន៍ PPSD ផ្សេងទៀតសម្រាប់ការរាយការណ៍ឬដាក់ពាក្យបណ្តឹងសម្រាប់ការជួយឬលើកទឹកចិត្តដល់ការដាក់ស្នើរបាយការណ៍ឬ បណ្តឹងសម្រាប់សហការក្នុងការស៊ើបអង្កេតក្រោមគោលនយោបាយនេះឬសម្រាប់ចាត់វិធានការស្របនឹងគោលការណ៍នេះ។
    </p>
    <p>
                វិសាលភាពគ្រប់រូបភាពនៃការបំភិតបំភ័យការយាយីការសម្លុតនិងការគំរាមកំហែងតាមអ៊ីនធឺណិត។
                    ការរំខានយាយីត្រូវបានហាមឃាត់មិនថានៅក្នុងថ្នាក់រៀននៅក្នុងបរិវេណសាលាដែលនៅជាប់នឹងបរិវេណសាលាភ្លាមៗនៅពេលដែលសិស្សហ្វាឌីភីធ្វើដំណើរទៅឬមកពីសាលារៀន (ផតថលទៅវិបផតថល) ឬនៅក្នុងព្រឹត្តិការណ៍ដែលឧបត្ថម្ភដោយ សាលាថាតើវាត្រូវបានធ្វើឬមិនបាននៅបរិវេណសាលា។ ។
                    Providence Providence Providence Public Services Providence, Rhode Island "ធ្វើដំណើរទៅឬមកពីសាលារៀន (ផតថលទៅវិបផតថល)" រួមបញ្ចូលផងដែរប៉ុន្តែមិនត្រូវបានកំណត់ចំពោះ (នៅទីនេះ "រួមបញ្ចូល") នៅលើឡានក្រុងសាលារៀនឬរថយន្តដែលទាក់ទងនឹងសាលារៀន (រួមទាំង ការប្រើប្រាស់លិខិតឆ្លងដែនឡានក្រុងដែលចេញដោយស្រុក) នៅចំណតឡានក្រុងសាលាផ្លូវការនិងដើរទៅសាលារៀនពីសាលារៀនក្នុងរយៈពេលសមរម្យមុនរឺក្រោយម៉ោងសិក្សា។
                    ការសម្លុតឬការយាយីរួមទាំងការគំរាមកំហែងតាមអ៊ិនធរណេតឬការសម្លុតតាមអ៊ិនធឺរណែតដែលមិនចាប់ផ្តើមនៅក្នុងទីតាំងដែលបានកំណត់ពីមុនត្រូវបានគ្របដណ្តប់ដោយគោលការណ៍នេះប្រសិនបើឧប្បត្តិហេតុនេះបណ្តាលឱ្យមានការរំខានដល់បរិស្ថានសិក្សាយ៉ាងខ្លាំងសម្រាប់មនុស្សម្នាក់ឬច្រើននាក់និង / ឬថ្ងៃដែលមានរបៀបរៀបរយ - ប្រតិបត្តិការប្រចាំថ្ងៃរបស់កម្មវិធីសាលារៀនឬសាលារៀនណាមួយ។
                </p>

                <p>
                ផ្តល់ព័ត៌មាននិងសមាជិកម្នាក់ៗនៃសហគមន៍អេហ្វឌីភីមានទំនួលខុសត្រូវក្នុងការជូនដំណឹងអំពីការស៊ើបអង្កេតចំណេះដឹងអំពីឥរិយាបទណាមួយដែលមាននៅក្នុងគោលការណ៍នេះឬព័ត៌មានដែលគួរអោយទុកចិត្តបាន។
                    សកម្មភាពនោះបានកើតឡើង។ អគ្គនាយកឬអ្នករចនានឹងកំណត់អត្តសញ្ញាណបុគ្គលជាក់លាក់ដែលទទួលខុសត្រូវចំពោះការទទួលនិងតាមដានរបាយការណ៍បែបនេះសម្រាប់អាគារសិក្សាមួយនៅដើមឆ្នាំសិក្សានីមួយៗហើយបាននិយាយថាមនុស្សនឹងសម្របសម្រួលនិងរាយការណ៍លទ្ធផលនៃការស៊ើបអង្កេតទៅចំណងជើងទី ៩ នៃស្រុកទាំងមូលឱ្យបានទាន់ពេលវេលា។ / អ្នកសម្របសម្រួលសមធម៌ក៏ត្រូវបានតែងតាំងដោយអគ្គនាយកឬអ្នករចនា។
                    ប្រសិនបើរបាយការណ៍ស្តីពីការគំរាមកំហែងតាមអ៊ីនធឺណិតនិង / ឬការគំរាមកំហែងតាមអ៊ីនធឺណិតទាក់ទងនឹងឧប្បត្តិហេតុដែលបានចាប់ផ្តើមនៅក្រៅវិសាលភាព (ដូចបានកំណត់ខាងលើ) អគ្គនាយកនឹងធ្វើការស៊ើបអង្កេតដើម្បីរាយការណ៍ដើម្បីកំណត់ថាតើឧប្បត្តិហេតុនេះបណ្តាលឱ្យមានការរំខានដល់បរិស្ថានសិក្សា សម្រាប់បុគ្គលម្នាក់ឬច្រើននាក់និង / ឬប្រតិបត្តិការប្រចាំថ្ងៃរបស់សាលាឬកម្មវិធីសាលារៀនដែលបានបញ្ជាទិញ។

                </p>
               
<p>
                    នីតិវិធីស្រុកអគ្គនាយកនឹងកំណត់“ គោលការណ៍ណែនាំនិងនីតិវិធីសម្រាប់
                    អនុវត្តគោលនយោបាយសម្លុតនិងការយាយីនិងគោលនយោបាយអំពើហឹង្សារបស់ដៃគូ” ។
                    អគ្គនាយកនឹងផ្តល់នូវគោលការណ៍ណែនាំសមស្របតាមអាយុសម្រាប់សាលារៀននីមួយៗដើម្បីរាយការណ៍និងស៊ើបអង្កេតអំពីឧប្បត្តិហេតុនៃការសម្លុតឬយាយី។ អ្នកដែលទទួលខុសត្រូវចំពោះការទទួលនិងតាមដានលើរបាយការណ៍នឹងត្រូវបានកំណត់នៅក្នុងនីតិវិធីទាំងនេះ។ គោលការណ៍ណែនាំទាំងនេះនឹងរួមបញ្ចូលនូវទម្រង់របាយការណ៍ស្តង់ដារមួយដែលត្រូវបានប្រើប្រាស់ដោយសមាជិកនៃសហគមន៍អេហ្វឌីភី។ គោលបំណងនៃសំណុំបែបបទរបាយការណ៍នេះគឺដើម្បីធ្វើឱ្យមានការស៊ើបអង្កេតដែលការពារសុវត្ថិភាពនៃគោលដៅអ្នកទស្សនានិង / ឬសមាជិកគ្រួសារ / អាណាព្យាបាល / សមាជិកសហគមន៍ដែលចាប់អារម្មណ៍។
                    គោលការណ៍ណែនាំទាំងនេះនឹងរួមបញ្ចូលគោលការណ៍ណែនាំច្បាស់លាស់ស្តីពីពេលវេលានិងវិធីរាយការណ៍អំពីការយាយីឬការយាយីគួរតែត្រូវបានអនុវត្តចំពោះការអនុវត្តច្បាប់សម្រាប់ការស៊ើបអង្កេតអំពីបទឧក្រិដ្ឋដែលអាចកើតមាន។
                    នៅក្នុងតម្រូវការរបស់ FERPA គោលការណ៍ណែនាំនិងនីតិវិធីសម្រាប់ការអនុវត្តគោលនយោបាយស្តីពីការសម្លុតនិងការយាយីនិងគោលការណ៍អំពើហឹង្សារបស់ដៃគូនឹងរាប់បញ្ចូលនូវចំនួនពេលវេលាជាក់លាក់ណាមួយដែលឪពុកម្តាយនឹងត្រូវជូនដំណឹងអំពីបណ្តឹងតវ៉ានិងរយៈពេលជាក់លាក់ណាមួយដើម្បីបំពេញ ការស៊ើបអង្កេត។
                    លើសពីនេះគោលការណ៍ណែនាំនិងនីតិវិធីសម្រាប់ការអនុវត្តគោលនយោបាយការយាយីនិងការយាយីនិងគោលនយោបាយអំពើហឹង្សារបស់ដៃគូក៏នឹងរួមបញ្ចូលផងដែរនូវផែនការទំនាក់ទំនងជាមួយឪពុកម្តាយ / អាណាព្យាបាលការអភិវឌ្ឍន៍វិជ្ជាជីវៈ។
                    Providence Providence Public Schools Providence, Rhode Island សម្រាប់បុគ្គលិកទាំងអស់និងការណែនាំសម្រាប់សិស្សគ្រប់កម្រិតសាលាស្តីពីការរៀនសូត្រអារម្មណ៍សង្គមនិងការការពារអំពើហឹង្សា។
                </p>
                    

                <p>
                    ផលវិកាៈផលវិបាកសមស្របនិងវិធានការកែតម្រូវសំរាប់និស្សិតដែលប្រព្រឹត្ត
                    សកម្មភាពនៃការរំខានឬការយាយីអាចខុសគ្នាពីការធ្វើអន្តរាគមន៍អាកប្បកិរិយាវិជ្ជមានរហូតដល់ការព្យួរឬការបដិសេធដែលត្រូវបានពិពណ៌នានៅក្នុង "ក្រមសីលធម៌ស្រុកថ្នាក់ទី PK-12" ។
                    ការសងសឹកឬការគំរាមកំហែងនៃការសងសឹកនៅក្នុងទម្រង់ណាមួយដែលត្រូវបានបង្កើតឡើងដើម្បីបំភិតបំភ័យជនរងគ្រោះនៃការយាយីឬការយាយីអ្នកដែលជាសាក្សីឬជាអ្នកស៊ើបអង្កេតអំពីឧប្បត្តិហេតុនៃការយាយីឬការយាយីនឹងត្រូវស្ថិតនៅក្រោមកំរិតទី ២ ឬទី ៣ នៅក្នុង“ ក្រមខណ្ឌនៃការប្រព្រឹត្តខណ្ឌថ្នាក់ PK ។ -១២” ។
                    សកម្មភាពនៃការសម្លុតឬធ្វើទុក្ខបុកម្នេញដែលត្រូវបានចោទប្រកាន់ដោយសមាជិកមនុស្សពេញវ័យ (រួមទាំងគ្រូបង្រៀនរដ្ឋបាលបុគ្គលិកបុគ្គលិកបុគ្គលិកសាលារៀនឪពុកម្តាយដៃគូសហគមន៍ឬភ្ញៀវទេសចរណ៍ដទៃទៀតនៅសាលារៀន) នឹងត្រូវរាយការណ៍ទៅអ្នកគ្រប់គ្រងសាលានិង / ឬទៅកាន់ការិយាល័យ PPSD ដែលបានចាត់តាំងសម្រាប់ការស៊ើបអង្កេតនិងលទ្ធផលស្របតាមនីតិវិធីដែលអាចអនុវត្តបានរាប់បញ្ចូលទាំងសកម្មភាពស្របច្បាប់សមស្រប។
                    ការសងសឹកឬការគំរាមកំហែងនៃការសងសឹកដោយសមាជិកមនុស្សពេញវ័យ (រួមទាំងគ្រូបង្រៀនរដ្ឋបាលបុគ្គលិកបុគ្គលិកបុគ្គលិកសាលារៀនឪពុកម្តាយដៃគូសហគមន៍ឬភ្ញៀវទេសចរដទៃទៀតមកសាលារៀន) នៃសហគមន៍អេហ្វ។ ភី។ អេសតាមមធ្យោបាយណាមួយដែលត្រូវបានរៀបចំឡើងដើម្បីបំភិតបំភ័យ ជនរងគ្រោះជាសាក្សីរឺអ្នកស៊ើបអង្កេតដែលធ្វើការសម្លុតឬយាយីនឹងរងផលវិបាកបន្ថែមទៀតដោយអនុលោមតាមនីតិវិធីសមស្រប។
                    </p>
                    
                    <p>
                    គណនេយ្យភាពប្រចាំឆ្នាំប្រចាំឆ្នាំអគ្គនាយកនឹងជូនដំណឹងដល់សាលាផងដែរ
                    ក្រុមប្រឹក្សាភិបាលមុនពេលចាប់ផ្តើមនៃឆ្នាំសិក្សានីមួយៗលើចំនួនពាក្យបណ្តឹងការស៊ើបអង្កេតសកម្មភាពដែលបានផ្ទៀងផ្ទាត់និងនិន្នាការនៃការយាយីការសម្លុតនិងការសម្លុតតាមអ៊ីនធឺណិត។
                    </p>

                <p>
                ការគាំទ្រដល់មុខតំណែងចាប់តាំងពីការសម្លុតនិងការយាយីធ្វើឱ្យសុខភាពផ្លូវចិត្តរបស់គោលដៅស្ថិតក្នុងហានិភ័យការបញ្ជូនឱ្យបានសមរម្យនឹងត្រូវបានធ្វើឡើងសម្រាប់សេវាកម្មគាំទ្រ។
                    សាលាត្រូវរក្សាការគាំទ្រនិងការប្រាស្រ័យទាក់ទងជាបន្ដបន្ទាប់ជាមួយគោលដៅដើម្បីធានាថាការសងសឹកចំពោះការរាយការណ៍អំពីអាកប្បកិរិយាណាមួយដែលមាននៅក្នុងគោលនយោបាយនេះត្រូវបានដោះស្រាយភ្លាមៗ។ គោលដៅនិងឪពុកម្តាយនៃគោលដៅគួរតែមានជំរើសជាច្រើនដើម្បីធានាសុវត្ថិភាពរាងកាយនិងអារម្មណ៍របស់មនុស្ស។
                </p>

                <p>
                ទិដ្ឋភាពច្បាប់ផ្សេងទៀតសមាជិកនៃសហគមន៍អេហ្វឌីឌីក៏អាចស្វែងរកដំណោះស្រាយផ្លូវច្បាប់ឬដោះស្រាយសំណងផ្សេងទៀតបានដែរប៉ុន្តែមិនមានកំណត់ចំពោះការដាក់ពាក្យបណ្តឹងឡើយ។
                    ជាមួយ: នាយកដ្ឋានអប់រំកោះរ៉ូដនៅ (៤០១) ២២២-៤៦០០; ការិយាល័យមេធាវីអន្តរជាតិកោះរ៉ូដផ្នែកសិទ្ធិស៊ីវិលនៅ (៤០១) ២៧៤-៤៤០០; ការិយាល័យសិទិ្ធស៊ីវិលនៃក្រសួងអប់រំសហរដ្ឋអាមេរិកនៅ (៦១៧) ២៨៩-០១១១ និង / ឬគណៈកម្មការឱកាសការងារស្មើគ្នានៅ (៨០០) ៦៦៩-៤០០០; ដាក់ពាក្យបណ្តឹងរដ្ឋប្បវេណី ឬកាត់ទោសការកាត់ទោសព្រហ្មទណ្ឌ។
                </p>

                <p>
                    ឯកសារយោងច្បាប់ R.I.G.L. ផ្នែក ១៦-២១-២៤ (សុវត្ថិភាពសាលារៀន)
                    R.I.G.L. ផ្នែក ១៦-២១-២៦ (ការសម្លុត / យាយី)
                    R.I.G.L. ផ្នែកទី ៦-៣៨-១.១ (ការរើសអើងភេទ) R.I. ផ្នែកឧត្តមសេនីយ៍ផ្នែក ៤២-១១២-១ et seq ។ (ច្បាប់សិទ្ធិស៊ីវិលរបស់កោះរ៉ូដនៅឆ្នាំ ១៩៩០) I ២៨-៥-១ អ៉ិក។ (ការអនុវត្តការងារពលកម្មការផ្តល់ការងារដោយយុត្តិធម៌របស់រដ្ឋ
                    ការអនុវត្ត) RI 42-28-1 et seq ។ (ឧក្រិដ្ឋកម្មស្អប់) (ពូជសាសន៍សាសនាជនជាតិភាគតិចផ្លូវភេទ
                    ការតំរង់ទិសយេនឌ័រឬការរើសអើងចំពោះពិការភាព R.I.G.L. ផ្នែកទី ១៦-៣៨-១ និងបន្ទាប់។ និង ១៦-៣៨-១.១ និងបន្ទាប់។ (ទាក់ទងនឹងអាយុ,
                    ការរើសអើងជាតិសាសន៍និងផ្លូវភេទនៅក្នុងការអប់រំ) R.I.G.L. ផ្នែក ៤២-៨៧-១ និងបន្ទាប់; (សិទ្ធិស៊ីវិលរបស់ប្រជាជនជាមួយ
                    ច្បាប់ស្តីពីពិការភាព) R.I.G.L. ផ្នែកទី ៤២-៨០.១-១ និងបន្ទាប់។ (ការស្ដារឡើងវិញនូវសេរីភាពសាសនា
                    ច្បាប់) អរ។ ឆ។ ផ្នែកទី ១១-៥២-៤.២, ១១-៥២-៤.៣ (លក្ខន្តិកៈព្រហ្មទណ្ឌទាក់ទងនឹង
                    ឧក្រិដ្ឋកម្មតាមអ៊ិនធឺរណែត) R.I.G.L ផ្នែកទី ១១-២១-១ (ច្បាប់ស្តីពីការបំភិតបំភ័យ RI) ច្បាប់ស្តីពីសិទ្ធិស៊ីវិលរបស់សហរដ្ឋអាមេរិក យូ។ ឆ្នាំ ១៩៦៤ ចំណងជើង VI (ការរើសអើងក្នុងការអប់រំផ្អែកលើមូលដ្ឋាន
                    នៅលើពូជសាសន៍ពណ៌សម្បុរឬដើមកំណើតជាតិ) ច្បាប់សិទ្ធិស៊ីវិលរបស់សហរដ្ឋអាមេរិក។ យូ។ ឆ្នាំ ១៩៦៤ ចំណងជើងទី ៧ (ផ្អែកលើការរើសអើងការងារ
                    លើពូជសាសន៍ពណ៌សម្បុរសាសនាភេទជាតិដើម) ចំណងជើងលេខ IX នៃវិសោធនកម្មអប់រំឆ្នាំ ១៩៧២ (សមធម៌យេនឌ័ររួមមាន
                    ការយាយីផ្លូវភេទ) ផ្នែកទី ៥០៤ នៃច្បាប់ស្តារនីតិសម្បទាឆ្នាំ ១៩៧៣ (ជនពិការ) ជនជាតិអាមេរិកដែលមានពិការភាពឆ្នាំ ១៩៩០
                    </p>
                    
                    <p>
                    ប្រវត្តិបានអនុម័ត _______
                    អ្នកផ្តល់សាលាសាធារណៈផ្តល់ជូន, កោះរ៉ូដ

                    </p>
                    </div>
                </div>
            </div>
        );
    }
}

export default Bully;